cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addMediaResourceList.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addMediaResourceList sequence="?">
         <mediaResourceList>
            <name>ASSIP-No-Media-MRGL</name>
            <members>
               <!--1 or more repetitions:-->
               <member>
                  <mediaResourceGroupName uuid="?">AS-SIP-Trunk-No-Media</mediaResourceGroupName>
                  <order>1</order>
               </member>
            </members>
         </mediaResourceList>
      </ns:addMediaResourceList>
   </soapenv:Body>
</soapenv:Envelope>
